{"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 1, 64, 64]}}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_1", "trainable": true, "border_mode": "same", "subsample": [1, 1], "activation": "linear", "nb_row": 3, "dim_ordering": "th", "init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 32}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid"}}, {"name": "dropout_1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_2", "trainable": true, "border_mode": "same", "subsample": [1, 1], "activation": "linear", "nb_row": 3, "dim_ordering": "th", "init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 64}}, {"name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid"}}, {"name": "dropout_2", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"name": "convolution2d_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_3", "trainable": true, "border_mode": "same", "subsample": [1, 1], "activation": "linear", "nb_row": 3, "dim_ordering": "th", "init": "he_normal", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 128}}, {"name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [8, 8], "pool_size": [8, 8], "dim_ordering": "th", "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid"}}, {"name": "flatten_13", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_13", "trainable": true}}, {"name": "dense_13", "inbound_nodes": [[["flatten_13", 0, 0]]], "class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_13", "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "input_dim": null, "output_dim": 10, "trainable": true, "b_regularizer": null}}, {"name": "activation_13", "inbound_nodes": [[["dense_13", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_13", "activation": "softmax", "trainable": true}}], "output_layers": [["activation_13", 0, 0]], "input_layers": [["input_1", 0, 0]]}}