{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "batch_input_shape": [null, 3, 64, 64], "name": "convolution2d_1", "nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "he_normal", "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "border_mode": "same", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "th", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_2", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "he_normal", "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "border_mode": "same", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "th", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_3", "nb_filter": 128, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "he_normal", "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "border_mode": "same", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [8, 8], "pool_size": [8, 8], "name": "maxpooling2d_3", "dim_ordering": "th", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}