{"class_name": "Model", "config": {"name": "model_14", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_13", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 1, 64, 48], "input_dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"name": "convolution2d_1", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activation": "relu", "trainable": true, "nb_row": 3, "W_constraint": null, "nb_filter": 32, "border_mode": "same", "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same", "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"name": "convolution2d_2", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activation": "relu", "trainable": true, "nb_row": 3, "W_constraint": null, "nb_filter": 64, "border_mode": "same", "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same", "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"name": "convolution2d_3", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activation": "relu", "trainable": true, "nb_row": 3, "W_constraint": null, "nb_filter": 128, "border_mode": "same", "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"name": "maxpooling2d_3", "pool_size": [4, 4], "strides": [4, 4], "border_mode": "same", "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_13", "config": {"name": "flatten_13", "trainable": true}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Dense", "name": "dense_13", "config": {"name": "dense_13", "b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "softmax", "trainable": true, "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_13", 0, 0]]]}]}}