{"config": {"output_layers": [["activation_26", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"b_regularizer": null, "nb_filter": 32, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "init": "he_normal", "name": "convolution2d_83", "W_constraint": null, "W_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_83", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_79", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_83", 0, 0]]], "name": "maxpooling2d_79", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_78"}, "inbound_nodes": [[["maxpooling2d_79", 0, 0]]], "name": "dropout_78", "class_name": "Dropout"}, {"config": {"b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "init": "he_normal", "name": "convolution2d_84", "W_constraint": null, "W_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["dropout_78", 0, 0]]], "name": "convolution2d_84", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_80", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_84", 0, 0]]], "name": "maxpooling2d_80", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_79"}, "inbound_nodes": [[["maxpooling2d_80", 0, 0]]], "name": "dropout_79", "class_name": "Dropout"}, {"config": {"b_regularizer": null, "nb_filter": 128, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_row": 3, "dim_ordering": "th", "border_mode": "same", "nb_col": 3, "init": "he_normal", "name": "convolution2d_85", "W_constraint": null, "W_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["dropout_79", 0, 0]]], "name": "convolution2d_85", "class_name": "Convolution2D"}, {"config": {"strides": [8, 8], "name": "maxpooling2d_81", "pool_size": [8, 8], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_85", 0, 0]]], "name": "maxpooling2d_81", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_26"}, "inbound_nodes": [[["maxpooling2d_81", 0, 0]]], "name": "flatten_26", "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_80"}, "inbound_nodes": [[["flatten_26", 0, 0]]], "name": "dropout_80", "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_26", "output_dim": 10, "activation": "linear", "W_regularizer": null}, "inbound_nodes": [[["dropout_80", 0, 0]]], "name": "dense_26", "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_26", "activation": "softmax"}, "inbound_nodes": [[["dense_26", 0, 0]]], "name": "activation_26", "class_name": "Activation"}], "name": "model_40"}, "class_name": "Model"}