{"config": [{"config": {"subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_1", "nb_col": 3, "nb_row": 3, "nb_filter": 32, "trainable": true, "batch_input_shape": [null, 1, 64, 64], "dim_ordering": "th", "activation": "linear", "W_constraint": null, "input_dtype": "float32", "W_regularizer": null, "init": "he_normal", "b_regularizer": null, "border_mode": "same", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "th", "name": "convolution2d_2", "nb_col": 3, "nb_row": 3, "nb_filter": 64, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "init": "he_normal", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "th", "name": "convolution2d_3", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "init": "he_normal", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [8, 8], "name": "maxpooling2d_3", "strides": [8, 8], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}