{"class_name": "Model", "config": {"name": "model_14", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32"}}, {"name": "convolution2d_44", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_filter": 32, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "border_mode": "same", "b_constraint": null, "name": "convolution2d_44", "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "subsample": [1, 1], "W_constraint": null, "init": "he_normal"}}, {"name": "maxpooling2d_40", "inbound_nodes": [[["convolution2d_44", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_40", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}}, {"name": "dropout_27", "inbound_nodes": [[["maxpooling2d_40", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_27", "p": 0.5, "trainable": true}}, {"name": "convolution2d_45", "inbound_nodes": [[["dropout_27", 0, 0]]], "class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "border_mode": "same", "b_constraint": null, "name": "convolution2d_45", "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "subsample": [1, 1], "W_constraint": null, "init": "he_normal"}}, {"name": "maxpooling2d_41", "inbound_nodes": [[["convolution2d_45", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_41", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}}, {"name": "dropout_28", "inbound_nodes": [[["maxpooling2d_41", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_28", "p": 0.5, "trainable": true}}, {"name": "convolution2d_46", "inbound_nodes": [[["dropout_28", 0, 0]]], "class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_filter": 128, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "border_mode": "same", "b_constraint": null, "name": "convolution2d_46", "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "subsample": [1, 1], "W_constraint": null, "init": "he_normal"}}, {"name": "maxpooling2d_42", "inbound_nodes": [[["convolution2d_46", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [8, 8], "name": "maxpooling2d_42", "pool_size": [8, 8], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}}, {"name": "flatten_13", "inbound_nodes": [[["maxpooling2d_42", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_13", "trainable": true}}, {"name": "dense_13", "inbound_nodes": [[["flatten_13", 0, 0]]], "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "linear", "W_constraint": null, "output_dim": 10}}, {"name": "activation_13", "inbound_nodes": [[["dense_13", 0, 0]]], "class_name": "Activation", "config": {"activation": "softmax", "name": "activation_13", "trainable": true}}], "output_layers": [["activation_13", 0, 0]]}}