{"config": {"name": "model_40", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3, 64, 64], "name": "input_1", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "name": "convolution2d_83", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "th", "init": "he_normal", "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 32, "name": "convolution2d_83", "trainable": true, "activation": "linear", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_79", "inbound_nodes": [[["convolution2d_83", 0, 0]]], "config": {"dim_ordering": "th", "name": "maxpooling2d_79", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "name": "dropout_78", "inbound_nodes": [[["maxpooling2d_79", 0, 0]]], "config": {"name": "dropout_78", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "name": "convolution2d_84", "inbound_nodes": [[["dropout_78", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "th", "init": "he_normal", "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "name": "convolution2d_84", "trainable": true, "activation": "linear", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_80", "inbound_nodes": [[["convolution2d_84", 0, 0]]], "config": {"dim_ordering": "th", "name": "maxpooling2d_80", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "name": "dropout_79", "inbound_nodes": [[["maxpooling2d_80", 0, 0]]], "config": {"name": "dropout_79", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "name": "convolution2d_85", "inbound_nodes": [[["dropout_79", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "th", "init": "he_normal", "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "name": "convolution2d_85", "trainable": true, "activation": "linear", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_81", "inbound_nodes": [[["convolution2d_85", 0, 0]]], "config": {"dim_ordering": "th", "name": "maxpooling2d_81", "strides": [8, 8], "trainable": true, "pool_size": [8, 8], "border_mode": "valid"}}, {"class_name": "Flatten", "name": "flatten_26", "inbound_nodes": [[["maxpooling2d_81", 0, 0]]], "config": {"name": "flatten_26", "trainable": true}}, {"class_name": "Dropout", "name": "dropout_80", "inbound_nodes": [[["flatten_26", 0, 0]]], "config": {"name": "dropout_80", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "name": "dense_26", "inbound_nodes": [[["dropout_80", 0, 0]]], "config": {"W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_26", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["dense_26", 0, 0]]], "config": {"activation": "softmax", "name": "activation_26", "trainable": true}}], "output_layers": [["activation_26", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}