{"config": [{"config": {"trainable": true, "activation": "linear", "batch_input_shape": [null, 3, 128, 96], "W_constraint": null, "input_dtype": "float32", "dim_ordering": "th", "name": "convolution2d_37", "nb_filter": 32, "border_mode": "same", "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_37"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_37"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "th", "name": "convolution2d_38", "nb_filter": 64, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_38"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_38"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "th", "name": "convolution2d_39", "nb_filter": 128, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [8, 8], "border_mode": "valid", "strides": [8, 8], "dim_ordering": "th", "name": "maxpooling2d_39"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_39"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_13"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias": true, "W_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_13", "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_13"}, "class_name": "Activation"}], "class_name": "Sequential"}