{"config": {"output_layers": [["activation_13", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 1, 64, 64]}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_44", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 32, "trainable": true, "dim_ordering": "th", "init": "he_normal"}, "name": "convolution2d_44", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_44", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "th", "name": "maxpooling2d_40"}, "name": "maxpooling2d_40", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_40", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "dropout_27"}, "name": "dropout_27", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_27", 0, 0]]], "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_45", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "trainable": true, "dim_ordering": "th", "init": "he_normal"}, "name": "convolution2d_45", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_45", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "th", "name": "maxpooling2d_41"}, "name": "maxpooling2d_41", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_41", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "dropout_28"}, "name": "dropout_28", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_28", 0, 0]]], "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_46", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 128, "trainable": true, "dim_ordering": "th", "init": "he_normal"}, "name": "convolution2d_46", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_46", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [8, 8], "strides": [8, 8], "trainable": true, "dim_ordering": "th", "name": "maxpooling2d_42"}, "name": "maxpooling2d_42", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_42", 0, 0]]], "config": {"trainable": true, "name": "flatten_13"}, "name": "flatten_13", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_13", 0, 0]]], "config": {"b_constraint": null, "activation": "linear", "input_dim": null, "W_constraint": null, "name": "dense_13", "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "name": "dense_13", "class_name": "Dense"}, {"inbound_nodes": [[["dense_13", 0, 0]]], "config": {"activation": "softmax", "trainable": true, "name": "activation_13"}, "name": "activation_13", "class_name": "Activation"}], "name": "model_14", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}