{"config": [{"config": {"nb_col": 3, "name": "convolution2d_37", "batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32", "dim_ordering": "th", "W_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "b_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "init": "he_normal", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_37", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_37", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "name": "convolution2d_38", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "trainable": true, "activity_regularizer": null, "nb_row": 3, "init": "he_normal", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_38", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_38", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "name": "convolution2d_39", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "b_regularizer": null, "nb_filter": 128, "trainable": true, "activity_regularizer": null, "nb_row": 3, "init": "he_normal", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_39", "trainable": true, "dim_ordering": "th", "pool_size": [8, 8], "border_mode": "valid", "strides": [8, 8]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_39", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_13", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_13", "output_dim": 10, "trainable": true, "input_dim": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_13", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}