{"config": [{"config": {"dim_ordering": "th", "nb_filter": 32, "border_mode": "same", "input_dtype": "float32", "nb_col": 3, "batch_input_shape": [null, 1, 64, 64], "trainable": true, "name": "convolution2d_1", "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "init": "he_normal", "W_constraint": null, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "trainable": true, "name": "convolution2d_2", "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "he_normal", "nb_row": 3, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "trainable": true, "name": "convolution2d_3", "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "he_normal", "nb_row": 3, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_3", "dim_ordering": "th", "border_mode": "valid", "pool_size": [8, 8], "strides": [8, 8]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "output_dim": 50, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "output_dim": 10, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}