{"config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 3, 128, 96], "input_dtype": "float32", "name": "convolution2d_1", "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "trainable": true, "init": "he_normal", "border_mode": "same", "subsample": [1, 1], "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_2", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_3", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_4", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_5", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_6", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_7", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_8", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_9", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "W_regularizer": null, "activation": "relu", "nb_col": 3, "W_constraint": null, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "trainable": true, "init": "he_normal", "name": "convolution2d_10", "dim_ordering": "th", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "output_dim": 10, "name": "dense_1", "W_regularizer": null, "activation": "linear", "input_dim": null, "W_constraint": null, "bias": true, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}