{"config": {"output_layers": [["dense_1", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 3, 64, 64]}, "inbound_nodes": []}, {"class_name": "Dropout", "name": "dropout_1", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_filter": 32, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "trainable": true, "dim_ordering": "th", "border_mode": "same", "b_constraint": null, "subsample": [1, 1], "W_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "same", "pool_size": [2, 2]}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "trainable": true, "dim_ordering": "th", "border_mode": "same", "b_constraint": null, "subsample": [1, 1], "W_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "same", "pool_size": [2, 2]}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_filter": 128, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "trainable": true, "dim_ordering": "th", "border_mode": "same", "b_constraint": null, "subsample": [1, 1], "W_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"trainable": true, "strides": [8, 8], "dim_ordering": "th", "name": "maxpooling2d_3", "border_mode": "same", "pool_size": [8, 8]}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "W_regularizer": null, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "b_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}