{"class_name": "Model", "config": {"output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32", "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "nb_row": 3, "nb_filter": 32, "subsample": [1, 1], "border_mode": "same", "b_constraint": null, "activation": "linear", "W_constraint": null, "nb_col": 3, "dim_ordering": "th"}, "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "th"}, "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "nb_row": 3, "nb_filter": 64, "subsample": [1, 1], "border_mode": "same", "b_constraint": null, "activation": "linear", "W_constraint": null, "nb_col": 3, "dim_ordering": "th"}, "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "th"}, "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "trainable": true, "nb_row": 3, "nb_filter": 128, "subsample": [1, 1], "border_mode": "same", "b_constraint": null, "activation": "linear", "W_constraint": null, "nb_col": 3, "dim_ordering": "th"}, "name": "convolution2d_3", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_3", "strides": [8, 8], "pool_size": [8, 8], "trainable": true, "dim_ordering": "th"}, "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 10, "input_dim": null, "b_constraint": null, "activation": "linear", "bias": true}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "name": "activation_1", "inbound_nodes": [[["dense_1", 0, 0]]]}], "name": "model_2"}}