{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 3, 64, 64], "nb_col": 3, "nb_filter": 32, "init": "he_normal", "trainable": true, "activation": "linear", "name": "convolution2d_1", "W_regularizer": null, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "b_constraint": null, "input_dtype": "float32", "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "nb_filter": 64, "init": "he_normal", "nb_row": 3, "trainable": true, "activation": "linear", "name": "convolution2d_2", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "nb_filter": 128, "init": "he_normal", "nb_row": 3, "trainable": true, "activation": "linear", "name": "convolution2d_3", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [8, 8], "name": "maxpooling2d_3", "pool_size": [8, 8], "dim_ordering": "th", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 10, "trainable": true, "activation": "linear", "name": "dense_1", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}