{"class_name": "Sequential", "config": [{"class_name": "GaussianNoise", "config": {"input_dtype": "float32", "name": "gaussiannoise_1", "sigma": 0.05, "trainable": true, "batch_input_shape": [null, 1, 64, 64]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "batch_input_shape": [null, 1, 64, 64], "subsample": [1, 1], "nb_row": 3, "trainable": true, "nb_col": 3, "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "border_mode": "same", "activation": "linear", "W_constraint": null, "init": "he_normal", "b_regularizer": null, "b_constraint": null, "nb_filter": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "trainable": true, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activation": "linear", "init": "he_normal", "b_regularizer": null, "b_constraint": null, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "trainable": true, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activation": "linear", "init": "he_normal", "b_regularizer": null, "b_constraint": null, "nb_filter": 128}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [4, 4], "pool_size": [4, 4], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "trainable": true, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activation": "linear", "init": "he_normal", "b_regularizer": null, "b_constraint": null, "nb_filter": 256}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "strides": [4, 4], "pool_size": [4, 4], "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "input_dim": null, "W_constraint": null, "activation": "linear", "output_dim": 10, "trainable": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}