{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32", "name": "flatten_13"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_13", "input_dim": null, "activation": "linear", "W_constraint": null, "trainable": true, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_13"}, "class_name": "Activation"}], "class_name": "Sequential"}