{"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "init": "glorot_uniform", "output_dim": 10, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}