{"config": [{"config": {"batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32", "b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "trainable": true, "init": "he_normal", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_1", "b_constraint": null, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "th", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "trainable": true, "init": "he_normal", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_2", "b_constraint": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "th", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "trainable": true, "init": "he_normal", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_3", "b_constraint": null, "nb_filter": 128}, "class_name": "Convolution2D"}, {"config": {"pool_size": [8, 8], "dim_ordering": "th", "trainable": true, "strides": [8, 8], "border_mode": "valid", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "output_dim": 10, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}