{"config": {"layers": [{"config": {"batch_input_shape": [null, 1, 64, 64], "name": "input_1", "input_dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"init": "he_normal", "W_constraint": null, "name": "convolution2d_1", "nb_row": 3, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_col": 3, "border_mode": "same", "dim_ordering": "th", "b_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null}, "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_1"}, "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Dropout"}, {"config": {"init": "he_normal", "W_constraint": null, "name": "convolution2d_2", "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_col": 3, "border_mode": "same", "dim_ordering": "th", "b_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null}, "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_2"}, "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Dropout"}, {"config": {"init": "he_normal", "W_constraint": null, "name": "convolution2d_3", "nb_row": 3, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_col": 3, "border_mode": "same", "dim_ordering": "th", "b_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null}, "name": "convolution2d_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [8, 8], "dim_ordering": "th", "strides": [8, 8], "name": "maxpooling2d_3"}, "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "name": "dense_1", "activation": "linear", "activity_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "name": "activation_1", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Activation"}], "name": "model_2", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "class_name": "Model"}