{"config": [{"config": {"b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 1, 64, 64], "dim_ordering": "th", "nb_col": 3, "name": "convolution2d_1", "input_dtype": "float32", "activation": "linear", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 32, "border_mode": "same", "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "th", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "trainable": true, "name": "convolution2d_2", "nb_col": 3, "activity_regularizer": null, "dim_ordering": "th", "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 64, "border_mode": "same", "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "th", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "trainable": true, "name": "convolution2d_3", "nb_col": 3, "activity_regularizer": null, "dim_ordering": "th", "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 128, "border_mode": "same", "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "name": "maxpooling2d_3", "dim_ordering": "th", "trainable": true, "border_mode": "valid", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "trainable": true, "name": "convolution2d_4", "nb_col": 3, "activity_regularizer": null, "dim_ordering": "th", "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "border_mode": "same", "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "name": "maxpooling2d_4", "dim_ordering": "th", "trainable": true, "border_mode": "valid", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "input_dim": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}